/* automatically generated by rust-bindgen 0.70.1 */

pub const CL_TARGET_OPENCL_VERSION: u32 = 300;
pub const CL_VERSION_3_0: u32 = 1;
pub const CL_VERSION_2_2: u32 = 1;
pub const CL_VERSION_2_1: u32 = 1;
pub const CL_VERSION_2_0: u32 = 1;
pub const CL_VERSION_1_2: u32 = 1;
pub const CL_VERSION_1_1: u32 = 1;
pub const CL_VERSION_1_0: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;

pub const CL_COMMAND_SVM_MAP: u32 = 4620;
pub const CL_COMMAND_SVM_UNMAP: u32 = 4621;
pub const CL_COMMAND_SVM_MIGRATE_MEM: u32 = 4622;
pub const CL_COMPLETE: u32 = 0;
pub const CL_RUNNING: u32 = 1;
pub const CL_SUBMITTED: u32 = 2;
pub const CL_QUEUED: u32 = 3;
pub const CL_BUFFER_CREATE_TYPE_REGION: u32 = 4640;
pub const CL_PROFILING_COMMAND_QUEUED: u32 = 4736;
pub const CL_PROFILING_COMMAND_SUBMIT: u32 = 4737;
pub const CL_PROFILING_COMMAND_START: u32 = 4738;
pub const CL_PROFILING_COMMAND_END: u32 = 4739;
pub const CL_PROFILING_COMMAND_COMPLETE: u32 = 4740;
pub const CL_DEVICE_ATOMIC_ORDER_RELAXED: u32 = 1;
pub const CL_DEVICE_ATOMIC_ORDER_ACQ_REL: u32 = 2;
pub const CL_DEVICE_ATOMIC_ORDER_SEQ_CST: u32 = 4;
pub const CL_DEVICE_ATOMIC_SCOPE_WORK_ITEM: u32 = 8;
pub const CL_DEVICE_ATOMIC_SCOPE_WORK_GROUP: u32 = 16;
pub const CL_DEVICE_ATOMIC_SCOPE_DEVICE: u32 = 32;
pub const CL_DEVICE_ATOMIC_SCOPE_ALL_DEVICES: u32 = 64;
pub const CL_DEVICE_QUEUE_SUPPORTED: u32 = 1;
pub const CL_DEVICE_QUEUE_REPLACEABLE_DEFAULT: u32 = 2;
pub const CL_KHRONOS_VENDOR_ID_CODEPLAY: u32 = 65540;
pub const CL_VERSION_MAJOR_BITS: u32 = 10;
pub const CL_VERSION_MINOR_BITS: u32 = 10;
pub const CL_VERSION_PATCH_BITS: u32 = 12;
pub const CL_VERSION_MAJOR_MASK: u32 = 1023;
pub const CL_VERSION_MINOR_MASK: u32 = 1023;
pub const CL_VERSION_PATCH_MASK: u32 = 4095;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type cl_char = i8;
pub type cl_uchar = u8;
pub type cl_short = i16;
pub type cl_ushort = u16;
pub type cl_int = i32;
pub type cl_uint = u32;
pub type cl_long = i64;
pub type cl_ulong = u64;
pub type cl_half = u16;
pub type cl_float = f32;
pub type cl_double = f64;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub type cl_GLuint = ::std::os::raw::c_uint;
pub type cl_GLint = ::std::os::raw::c_int;
pub type cl_GLenum = ::std::os::raw::c_uint;
pub type __m64 = [::std::os::raw::c_longlong; 1usize];
pub type __v1di = [::std::os::raw::c_longlong; 1usize];
pub type __v2si = [::std::os::raw::c_int; 2usize];
pub type __v4hi = [::std::os::raw::c_short; 4usize];
pub type __v8qi = [::std::os::raw::c_char; 8usize];
pub type __v4si = [::std::os::raw::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128_u = [f32; 4usize];
pub type __v4su = [::std::os::raw::c_uint; 4usize];
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(__i: ::std::os::raw::c_uint);
}
pub type __m128d = [f64; 2usize];
pub type __m128i = [::std::os::raw::c_longlong; 2usize];
pub type __m128d_u = [f64; 2usize];
pub type __m128i_u = [::std::os::raw::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [::std::os::raw::c_longlong; 2usize];
pub type __v8hi = [::std::os::raw::c_short; 8usize];
pub type __v16qi = [::std::os::raw::c_char; 16usize];
pub type __v2du = [::std::os::raw::c_ulonglong; 2usize];
pub type __v8hu = [::std::os::raw::c_ushort; 8usize];
pub type __v16qu = [::std::os::raw::c_uchar; 16usize];
pub type __v16qs = [::std::os::raw::c_schar; 16usize];
extern "C" {
    pub fn _mm_clflush(__p: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
extern "C" {
    pub fn _mm_pause();
}
pub type __cl_float4 = [f32; 4usize];
pub type __cl_uchar16 = [cl_uchar; 16usize];
pub type __cl_char16 = [cl_char; 16usize];
pub type __cl_ushort8 = [cl_ushort; 8usize];
pub type __cl_short8 = [cl_short; 8usize];
pub type __cl_uint4 = [cl_uint; 4usize];
pub type __cl_int4 = [cl_int; 4usize];
pub type __cl_ulong2 = [cl_ulong; 2usize];
pub type __cl_long2 = [cl_long; 2usize];
pub type __cl_double2 = [cl_double; 2usize];
pub type __cl_uchar8 = [cl_uchar; 8usize];
pub type __cl_char8 = [cl_char; 8usize];
pub type __cl_ushort4 = [cl_ushort; 4usize];
pub type __cl_short4 = [cl_short; 4usize];
pub type __cl_uint2 = [cl_uint; 2usize];
pub type __cl_int2 = [cl_int; 2usize];
pub type __cl_ulong1 = [cl_ulong; 1usize];
pub type __cl_long1 = [cl_long; 1usize];
pub type __cl_float2 = [cl_float; 2usize];
#[repr(C)]
#[repr(align(2))]
#[derive(Copy, Clone)]
pub union cl_char2 {
    pub s: [cl_char; 2usize],
    pub __bindgen_anon_1: cl_char2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_char2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_char2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char2__bindgen_ty_1 {
    pub x: cl_char,
    pub y: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char2__bindgen_ty_1"][::std::mem::size_of::<cl_char2__bindgen_ty_1>() - 2usize];
    ["Alignment of cl_char2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_char2__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_char2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_char2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_1, y) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char2__bindgen_ty_2 {
    pub s0: cl_char,
    pub s1: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char2__bindgen_ty_2"][::std::mem::size_of::<cl_char2__bindgen_ty_2>() - 2usize];
    ["Alignment of cl_char2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_char2__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_char2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_char2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_2, s1) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char2__bindgen_ty_3 {
    pub lo: cl_char,
    pub hi: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char2__bindgen_ty_3"][::std::mem::size_of::<cl_char2__bindgen_ty_3>() - 2usize];
    ["Alignment of cl_char2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_char2__bindgen_ty_3>() - 1usize];
    ["Offset of field: cl_char2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_char2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_char2__bindgen_ty_3, hi) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char2"][::std::mem::size_of::<cl_char2>() - 2usize];
    ["Alignment of cl_char2"][::std::mem::align_of::<cl_char2>() - 2usize];
    ["Offset of field: cl_char2::s"][::std::mem::offset_of!(cl_char2, s) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union cl_char4 {
    pub s: [cl_char; 4usize],
    pub __bindgen_anon_1: cl_char4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_char4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_char4__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char4__bindgen_ty_1 {
    pub x: cl_char,
    pub y: cl_char,
    pub z: cl_char,
    pub w: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char4__bindgen_ty_1"][::std::mem::size_of::<cl_char4__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_char4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_char4__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_char4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_char4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_char4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_char4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_1, w) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char4__bindgen_ty_2 {
    pub s0: cl_char,
    pub s1: cl_char,
    pub s2: cl_char,
    pub s3: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char4__bindgen_ty_2"][::std::mem::size_of::<cl_char4__bindgen_ty_2>() - 4usize];
    ["Alignment of cl_char4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_char4__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_char4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_char4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_char4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_char4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_2, s3) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_char4__bindgen_ty_3 {
    pub lo: cl_char2,
    pub hi: cl_char2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char4__bindgen_ty_3"][::std::mem::size_of::<cl_char4__bindgen_ty_3>() - 4usize];
    ["Alignment of cl_char4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_char4__bindgen_ty_3>() - 2usize];
    ["Offset of field: cl_char4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_char4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_char4__bindgen_ty_3, hi) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char4"][::std::mem::size_of::<cl_char4>() - 4usize];
    ["Alignment of cl_char4"][::std::mem::align_of::<cl_char4>() - 4usize];
    ["Offset of field: cl_char4::s"][::std::mem::offset_of!(cl_char4, s) - 0usize];
};
pub type cl_char3 = cl_char4;
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_char8 {
    pub s: [cl_char; 8usize],
    pub __bindgen_anon_1: cl_char8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_char8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_char8__bindgen_ty_3,
    pub v8: __cl_char8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char8__bindgen_ty_1 {
    pub x: cl_char,
    pub y: cl_char,
    pub z: cl_char,
    pub w: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char8__bindgen_ty_1"][::std::mem::size_of::<cl_char8__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_char8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_char8__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_char8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_char8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_char8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_char8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_1, w) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char8__bindgen_ty_2 {
    pub s0: cl_char,
    pub s1: cl_char,
    pub s2: cl_char,
    pub s3: cl_char,
    pub s4: cl_char,
    pub s5: cl_char,
    pub s6: cl_char,
    pub s7: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char8__bindgen_ty_2"][::std::mem::size_of::<cl_char8__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_char8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_char8__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s3) - 3usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s4) - 4usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s5) - 5usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s6) - 6usize];
    ["Offset of field: cl_char8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_2, s7) - 7usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_char8__bindgen_ty_3 {
    pub lo: cl_char4,
    pub hi: cl_char4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char8__bindgen_ty_3"][::std::mem::size_of::<cl_char8__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_char8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_char8__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_char8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_char8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_char8__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char8"][::std::mem::size_of::<cl_char8>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_char8"][::std::mem::align_of::<cl_char8>() - 8usize];
    ["Offset of field: cl_char8::s"][::std::mem::offset_of!(cl_char8, s) - 0usize];
    ["Offset of field: cl_char8::v8"][::std::mem::offset_of!(cl_char8, v8) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_char16 {
    pub s: [cl_char; 16usize],
    pub __bindgen_anon_1: cl_char16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_char16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_char16__bindgen_ty_3,
    pub v8: [__cl_char8; 2usize],
    pub v16: __cl_char16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char16__bindgen_ty_1 {
    pub x: cl_char,
    pub y: cl_char,
    pub z: cl_char,
    pub w: cl_char,
    pub __spacer4: cl_char,
    pub __spacer5: cl_char,
    pub __spacer6: cl_char,
    pub __spacer7: cl_char,
    pub __spacer8: cl_char,
    pub __spacer9: cl_char,
    pub sa: cl_char,
    pub sb: cl_char,
    pub sc: cl_char,
    pub sd: cl_char,
    pub se: cl_char,
    pub sf: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char16__bindgen_ty_1"][::std::mem::size_of::<cl_char16__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_char16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_char16__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_char16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_char16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_char16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_char16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, w) - 3usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer4) - 4usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer5) - 5usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer6) - 6usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer7) - 7usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer8) - 8usize];
    ["Offset of field: cl_char16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, __spacer9) - 9usize];
    ["Offset of field: cl_char16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, sa) - 10usize];
    ["Offset of field: cl_char16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, sb) - 11usize];
    ["Offset of field: cl_char16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, sc) - 12usize];
    ["Offset of field: cl_char16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, sd) - 13usize];
    ["Offset of field: cl_char16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, se) - 14usize];
    ["Offset of field: cl_char16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_1, sf) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_char16__bindgen_ty_2 {
    pub s0: cl_char,
    pub s1: cl_char,
    pub s2: cl_char,
    pub s3: cl_char,
    pub s4: cl_char,
    pub s5: cl_char,
    pub s6: cl_char,
    pub s7: cl_char,
    pub s8: cl_char,
    pub s9: cl_char,
    pub sA: cl_char,
    pub sB: cl_char,
    pub sC: cl_char,
    pub sD: cl_char,
    pub sE: cl_char,
    pub sF: cl_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char16__bindgen_ty_2"][::std::mem::size_of::<cl_char16__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_char16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_char16__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s3) - 3usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s4) - 4usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s5) - 5usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s6) - 6usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s7) - 7usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s8) - 8usize];
    ["Offset of field: cl_char16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, s9) - 9usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sA) - 10usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sB) - 11usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sC) - 12usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sD) - 13usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sE) - 14usize];
    ["Offset of field: cl_char16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_2, sF) - 15usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_char16__bindgen_ty_3 {
    pub lo: cl_char8,
    pub hi: cl_char8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char16__bindgen_ty_3"][::std::mem::size_of::<cl_char16__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_char16__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_char16__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_char16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_char16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_char16__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_char16"][::std::mem::size_of::<cl_char16>() - 16usize];
    ["Alignment of cl_char16"][::std::mem::align_of::<cl_char16>() - 16usize];
    ["Offset of field: cl_char16::s"][::std::mem::offset_of!(cl_char16, s) - 0usize];
    ["Offset of field: cl_char16::v8"][::std::mem::offset_of!(cl_char16, v8) - 0usize];
    ["Offset of field: cl_char16::v16"][::std::mem::offset_of!(cl_char16, v16) - 0usize];
};
#[repr(C)]
#[repr(align(2))]
#[derive(Copy, Clone)]
pub union cl_uchar2 {
    pub s: [cl_uchar; 2usize],
    pub __bindgen_anon_1: cl_uchar2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uchar2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uchar2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar2__bindgen_ty_1 {
    pub x: cl_uchar,
    pub y: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar2__bindgen_ty_1"][::std::mem::size_of::<cl_uchar2__bindgen_ty_1>() - 2usize];
    ["Alignment of cl_uchar2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uchar2__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_uchar2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uchar2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_1, y) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar2__bindgen_ty_2 {
    pub s0: cl_uchar,
    pub s1: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar2__bindgen_ty_2"][::std::mem::size_of::<cl_uchar2__bindgen_ty_2>() - 2usize];
    ["Alignment of cl_uchar2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uchar2__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_uchar2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uchar2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_2, s1) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar2__bindgen_ty_3 {
    pub lo: cl_uchar,
    pub hi: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar2__bindgen_ty_3"][::std::mem::size_of::<cl_uchar2__bindgen_ty_3>() - 2usize];
    ["Alignment of cl_uchar2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uchar2__bindgen_ty_3>() - 1usize];
    ["Offset of field: cl_uchar2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uchar2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uchar2__bindgen_ty_3, hi) - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar2"][::std::mem::size_of::<cl_uchar2>() - 2usize];
    ["Alignment of cl_uchar2"][::std::mem::align_of::<cl_uchar2>() - 2usize];
    ["Offset of field: cl_uchar2::s"][::std::mem::offset_of!(cl_uchar2, s) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union cl_uchar4 {
    pub s: [cl_uchar; 4usize],
    pub __bindgen_anon_1: cl_uchar4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uchar4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uchar4__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar4__bindgen_ty_1 {
    pub x: cl_uchar,
    pub y: cl_uchar,
    pub z: cl_uchar,
    pub w: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar4__bindgen_ty_1"][::std::mem::size_of::<cl_uchar4__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_uchar4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uchar4__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_uchar4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uchar4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_uchar4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_uchar4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_1, w) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar4__bindgen_ty_2 {
    pub s0: cl_uchar,
    pub s1: cl_uchar,
    pub s2: cl_uchar,
    pub s3: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar4__bindgen_ty_2"][::std::mem::size_of::<cl_uchar4__bindgen_ty_2>() - 4usize];
    ["Alignment of cl_uchar4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uchar4__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_uchar4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uchar4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_uchar4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_uchar4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_2, s3) - 3usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_uchar4__bindgen_ty_3 {
    pub lo: cl_uchar2,
    pub hi: cl_uchar2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar4__bindgen_ty_3"][::std::mem::size_of::<cl_uchar4__bindgen_ty_3>() - 4usize];
    ["Alignment of cl_uchar4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uchar4__bindgen_ty_3>() - 2usize];
    ["Offset of field: cl_uchar4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uchar4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uchar4__bindgen_ty_3, hi) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar4"][::std::mem::size_of::<cl_uchar4>() - 4usize];
    ["Alignment of cl_uchar4"][::std::mem::align_of::<cl_uchar4>() - 4usize];
    ["Offset of field: cl_uchar4::s"][::std::mem::offset_of!(cl_uchar4, s) - 0usize];
};
pub type cl_uchar3 = cl_uchar4;
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_uchar8 {
    pub s: [cl_uchar; 8usize],
    pub __bindgen_anon_1: cl_uchar8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uchar8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uchar8__bindgen_ty_3,
    pub v8: __cl_uchar8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar8__bindgen_ty_1 {
    pub x: cl_uchar,
    pub y: cl_uchar,
    pub z: cl_uchar,
    pub w: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar8__bindgen_ty_1"][::std::mem::size_of::<cl_uchar8__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_uchar8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uchar8__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_uchar8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uchar8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_uchar8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_uchar8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_1, w) - 3usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar8__bindgen_ty_2 {
    pub s0: cl_uchar,
    pub s1: cl_uchar,
    pub s2: cl_uchar,
    pub s3: cl_uchar,
    pub s4: cl_uchar,
    pub s5: cl_uchar,
    pub s6: cl_uchar,
    pub s7: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar8__bindgen_ty_2"][::std::mem::size_of::<cl_uchar8__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_uchar8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uchar8__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s3) - 3usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s4) - 4usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s5) - 5usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s6) - 6usize];
    ["Offset of field: cl_uchar8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_2, s7) - 7usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_uchar8__bindgen_ty_3 {
    pub lo: cl_uchar4,
    pub hi: cl_uchar4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar8__bindgen_ty_3"][::std::mem::size_of::<cl_uchar8__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_uchar8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uchar8__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_uchar8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uchar8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uchar8__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar8"][::std::mem::size_of::<cl_uchar8>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_uchar8"][::std::mem::align_of::<cl_uchar8>() - 8usize];
    ["Offset of field: cl_uchar8::s"][::std::mem::offset_of!(cl_uchar8, s) - 0usize];
    ["Offset of field: cl_uchar8::v8"][::std::mem::offset_of!(cl_uchar8, v8) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_uchar16 {
    pub s: [cl_uchar; 16usize],
    pub __bindgen_anon_1: cl_uchar16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uchar16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uchar16__bindgen_ty_3,
    pub v8: [__cl_uchar8; 2usize],
    pub v16: __cl_uchar16,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar16__bindgen_ty_1 {
    pub x: cl_uchar,
    pub y: cl_uchar,
    pub z: cl_uchar,
    pub w: cl_uchar,
    pub __spacer4: cl_uchar,
    pub __spacer5: cl_uchar,
    pub __spacer6: cl_uchar,
    pub __spacer7: cl_uchar,
    pub __spacer8: cl_uchar,
    pub __spacer9: cl_uchar,
    pub sa: cl_uchar,
    pub sb: cl_uchar,
    pub sc: cl_uchar,
    pub sd: cl_uchar,
    pub se: cl_uchar,
    pub sf: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_uchar16__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_uchar16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uchar16__bindgen_ty_1>() - 1usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, y) - 1usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, z) - 2usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, w) - 3usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer4) - 4usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer5) - 5usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer6) - 6usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer7) - 7usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer8) - 8usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, __spacer9) - 9usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, sa) - 10usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, sb) - 11usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, sc) - 12usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, sd) - 13usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, se) - 14usize];
    ["Offset of field: cl_uchar16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_1, sf) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uchar16__bindgen_ty_2 {
    pub s0: cl_uchar,
    pub s1: cl_uchar,
    pub s2: cl_uchar,
    pub s3: cl_uchar,
    pub s4: cl_uchar,
    pub s5: cl_uchar,
    pub s6: cl_uchar,
    pub s7: cl_uchar,
    pub s8: cl_uchar,
    pub s9: cl_uchar,
    pub sA: cl_uchar,
    pub sB: cl_uchar,
    pub sC: cl_uchar,
    pub sD: cl_uchar,
    pub sE: cl_uchar,
    pub sF: cl_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_uchar16__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_uchar16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uchar16__bindgen_ty_2>() - 1usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s1) - 1usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s2) - 2usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s3) - 3usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s4) - 4usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s5) - 5usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s6) - 6usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s7) - 7usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s8) - 8usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, s9) - 9usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sA) - 10usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sB) - 11usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sC) - 12usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sD) - 13usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sE) - 14usize];
    ["Offset of field: cl_uchar16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_2, sF) - 15usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_uchar16__bindgen_ty_3 {
    pub lo: cl_uchar8,
    pub hi: cl_uchar8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_uchar16__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_uchar16__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_uchar16__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_uchar16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uchar16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uchar16__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uchar16"][::std::mem::size_of::<cl_uchar16>() - 16usize];
    ["Alignment of cl_uchar16"][::std::mem::align_of::<cl_uchar16>() - 16usize];
    ["Offset of field: cl_uchar16::s"][::std::mem::offset_of!(cl_uchar16, s) - 0usize];
    ["Offset of field: cl_uchar16::v8"][::std::mem::offset_of!(cl_uchar16, v8) - 0usize];
    ["Offset of field: cl_uchar16::v16"][::std::mem::offset_of!(cl_uchar16, v16) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union cl_short2 {
    pub s: [cl_short; 2usize],
    pub __bindgen_anon_1: cl_short2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_short2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_short2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short2__bindgen_ty_1 {
    pub x: cl_short,
    pub y: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short2__bindgen_ty_1"][::std::mem::size_of::<cl_short2__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_short2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_short2__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_short2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_short2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_1, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short2__bindgen_ty_2 {
    pub s0: cl_short,
    pub s1: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short2__bindgen_ty_2"][::std::mem::size_of::<cl_short2__bindgen_ty_2>() - 4usize];
    ["Alignment of cl_short2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_short2__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_short2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_short2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_2, s1) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short2__bindgen_ty_3 {
    pub lo: cl_short,
    pub hi: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short2__bindgen_ty_3"][::std::mem::size_of::<cl_short2__bindgen_ty_3>() - 4usize];
    ["Alignment of cl_short2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_short2__bindgen_ty_3>() - 2usize];
    ["Offset of field: cl_short2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_short2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_short2__bindgen_ty_3, hi) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short2"][::std::mem::size_of::<cl_short2>() - 4usize];
    ["Alignment of cl_short2"][::std::mem::align_of::<cl_short2>() - 4usize];
    ["Offset of field: cl_short2::s"][::std::mem::offset_of!(cl_short2, s) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_short4 {
    pub s: [cl_short; 4usize],
    pub __bindgen_anon_1: cl_short4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_short4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_short4__bindgen_ty_3,
    pub v4: __cl_short4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short4__bindgen_ty_1 {
    pub x: cl_short,
    pub y: cl_short,
    pub z: cl_short,
    pub w: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short4__bindgen_ty_1"][::std::mem::size_of::<cl_short4__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_short4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_short4__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_short4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_short4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_short4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_short4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short4__bindgen_ty_2 {
    pub s0: cl_short,
    pub s1: cl_short,
    pub s2: cl_short,
    pub s3: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short4__bindgen_ty_2"][::std::mem::size_of::<cl_short4__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_short4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_short4__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_short4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_short4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_short4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_short4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_2, s3) - 6usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_short4__bindgen_ty_3 {
    pub lo: cl_short2,
    pub hi: cl_short2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short4__bindgen_ty_3"][::std::mem::size_of::<cl_short4__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_short4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_short4__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_short4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_short4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_short4__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short4"][::std::mem::size_of::<cl_short4>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_short4"][::std::mem::align_of::<cl_short4>() - 8usize];
    ["Offset of field: cl_short4::s"][::std::mem::offset_of!(cl_short4, s) - 0usize];
    ["Offset of field: cl_short4::v4"][::std::mem::offset_of!(cl_short4, v4) - 0usize];
};
pub type cl_short3 = cl_short4;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_short8 {
    pub s: [cl_short; 8usize],
    pub __bindgen_anon_1: cl_short8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_short8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_short8__bindgen_ty_3,
    pub v4: [__cl_short4; 2usize],
    pub v8: __cl_short8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short8__bindgen_ty_1 {
    pub x: cl_short,
    pub y: cl_short,
    pub z: cl_short,
    pub w: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short8__bindgen_ty_1"][::std::mem::size_of::<cl_short8__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_short8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_short8__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_short8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_short8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_short8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_short8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short8__bindgen_ty_2 {
    pub s0: cl_short,
    pub s1: cl_short,
    pub s2: cl_short,
    pub s3: cl_short,
    pub s4: cl_short,
    pub s5: cl_short,
    pub s6: cl_short,
    pub s7: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short8__bindgen_ty_2"][::std::mem::size_of::<cl_short8__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_short8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_short8__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_short8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_2, s7) - 14usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_short8__bindgen_ty_3 {
    pub lo: cl_short4,
    pub hi: cl_short4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short8__bindgen_ty_3"][::std::mem::size_of::<cl_short8__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_short8__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_short8__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_short8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_short8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_short8__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short8"][::std::mem::size_of::<cl_short8>() - 16usize];
    ["Alignment of cl_short8"][::std::mem::align_of::<cl_short8>() - 16usize];
    ["Offset of field: cl_short8::s"][::std::mem::offset_of!(cl_short8, s) - 0usize];
    ["Offset of field: cl_short8::v4"][::std::mem::offset_of!(cl_short8, v4) - 0usize];
    ["Offset of field: cl_short8::v8"][::std::mem::offset_of!(cl_short8, v8) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_short16 {
    pub s: [cl_short; 16usize],
    pub __bindgen_anon_1: cl_short16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_short16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_short16__bindgen_ty_3,
    pub v4: [__cl_short4; 4usize],
    pub v8: [__cl_short8; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short16__bindgen_ty_1 {
    pub x: cl_short,
    pub y: cl_short,
    pub z: cl_short,
    pub w: cl_short,
    pub __spacer4: cl_short,
    pub __spacer5: cl_short,
    pub __spacer6: cl_short,
    pub __spacer7: cl_short,
    pub __spacer8: cl_short,
    pub __spacer9: cl_short,
    pub sa: cl_short,
    pub sb: cl_short,
    pub sc: cl_short,
    pub sd: cl_short,
    pub se: cl_short,
    pub sf: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_short16__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_short16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_short16__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_short16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_short16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_short16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_short16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, w) - 6usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer4) - 8usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer5) - 10usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer6) - 12usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer7) - 14usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer8) - 16usize];
    ["Offset of field: cl_short16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, __spacer9) - 18usize];
    ["Offset of field: cl_short16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, sa) - 20usize];
    ["Offset of field: cl_short16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, sb) - 22usize];
    ["Offset of field: cl_short16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, sc) - 24usize];
    ["Offset of field: cl_short16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, sd) - 26usize];
    ["Offset of field: cl_short16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, se) - 28usize];
    ["Offset of field: cl_short16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_1, sf) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_short16__bindgen_ty_2 {
    pub s0: cl_short,
    pub s1: cl_short,
    pub s2: cl_short,
    pub s3: cl_short,
    pub s4: cl_short,
    pub s5: cl_short,
    pub s6: cl_short,
    pub s7: cl_short,
    pub s8: cl_short,
    pub s9: cl_short,
    pub sA: cl_short,
    pub sB: cl_short,
    pub sC: cl_short,
    pub sD: cl_short,
    pub sE: cl_short,
    pub sF: cl_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_short16__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_short16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_short16__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s7) - 14usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s8) - 16usize];
    ["Offset of field: cl_short16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, s9) - 18usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sA) - 20usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sB) - 22usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sC) - 24usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sD) - 26usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sE) - 28usize];
    ["Offset of field: cl_short16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_2, sF) - 30usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_short16__bindgen_ty_3 {
    pub lo: cl_short8,
    pub hi: cl_short8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_short16__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_short16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_short16__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_short16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_short16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_short16__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_short16"][::std::mem::size_of::<cl_short16>() - 32usize];
    ["Alignment of cl_short16"][::std::mem::align_of::<cl_short16>() - 32usize];
    ["Offset of field: cl_short16::s"][::std::mem::offset_of!(cl_short16, s) - 0usize];
    ["Offset of field: cl_short16::v4"][::std::mem::offset_of!(cl_short16, v4) - 0usize];
    ["Offset of field: cl_short16::v8"][::std::mem::offset_of!(cl_short16, v8) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union cl_ushort2 {
    pub s: [cl_ushort; 2usize],
    pub __bindgen_anon_1: cl_ushort2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ushort2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ushort2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort2__bindgen_ty_1 {
    pub x: cl_ushort,
    pub y: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort2__bindgen_ty_1"]
        [::std::mem::size_of::<cl_ushort2__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_ushort2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ushort2__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_ushort2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ushort2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_1, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort2__bindgen_ty_2 {
    pub s0: cl_ushort,
    pub s1: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort2__bindgen_ty_2"]
        [::std::mem::size_of::<cl_ushort2__bindgen_ty_2>() - 4usize];
    ["Alignment of cl_ushort2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ushort2__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_ushort2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ushort2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_2, s1) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort2__bindgen_ty_3 {
    pub lo: cl_ushort,
    pub hi: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort2__bindgen_ty_3"]
        [::std::mem::size_of::<cl_ushort2__bindgen_ty_3>() - 4usize];
    ["Alignment of cl_ushort2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ushort2__bindgen_ty_3>() - 2usize];
    ["Offset of field: cl_ushort2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ushort2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ushort2__bindgen_ty_3, hi) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort2"][::std::mem::size_of::<cl_ushort2>() - 4usize];
    ["Alignment of cl_ushort2"][::std::mem::align_of::<cl_ushort2>() - 4usize];
    ["Offset of field: cl_ushort2::s"][::std::mem::offset_of!(cl_ushort2, s) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_ushort4 {
    pub s: [cl_ushort; 4usize],
    pub __bindgen_anon_1: cl_ushort4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ushort4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ushort4__bindgen_ty_3,
    pub v4: __cl_ushort4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort4__bindgen_ty_1 {
    pub x: cl_ushort,
    pub y: cl_ushort,
    pub z: cl_ushort,
    pub w: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort4__bindgen_ty_1"]
        [::std::mem::size_of::<cl_ushort4__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_ushort4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ushort4__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_ushort4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ushort4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_ushort4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_ushort4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort4__bindgen_ty_2 {
    pub s0: cl_ushort,
    pub s1: cl_ushort,
    pub s2: cl_ushort,
    pub s3: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort4__bindgen_ty_2"]
        [::std::mem::size_of::<cl_ushort4__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_ushort4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ushort4__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_ushort4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ushort4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_ushort4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_ushort4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_2, s3) - 6usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_ushort4__bindgen_ty_3 {
    pub lo: cl_ushort2,
    pub hi: cl_ushort2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort4__bindgen_ty_3"]
        [::std::mem::size_of::<cl_ushort4__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_ushort4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ushort4__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_ushort4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ushort4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ushort4__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort4"][::std::mem::size_of::<cl_ushort4>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_ushort4"][::std::mem::align_of::<cl_ushort4>() - 8usize];
    ["Offset of field: cl_ushort4::s"][::std::mem::offset_of!(cl_ushort4, s) - 0usize];
    ["Offset of field: cl_ushort4::v4"][::std::mem::offset_of!(cl_ushort4, v4) - 0usize];
};
pub type cl_ushort3 = cl_ushort4;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_ushort8 {
    pub s: [cl_ushort; 8usize],
    pub __bindgen_anon_1: cl_ushort8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ushort8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ushort8__bindgen_ty_3,
    pub v4: [__cl_ushort4; 2usize],
    pub v8: __cl_ushort8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort8__bindgen_ty_1 {
    pub x: cl_ushort,
    pub y: cl_ushort,
    pub z: cl_ushort,
    pub w: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort8__bindgen_ty_1"]
        [::std::mem::size_of::<cl_ushort8__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_ushort8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ushort8__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_ushort8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ushort8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_ushort8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_ushort8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort8__bindgen_ty_2 {
    pub s0: cl_ushort,
    pub s1: cl_ushort,
    pub s2: cl_ushort,
    pub s3: cl_ushort,
    pub s4: cl_ushort,
    pub s5: cl_ushort,
    pub s6: cl_ushort,
    pub s7: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort8__bindgen_ty_2"]
        [::std::mem::size_of::<cl_ushort8__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_ushort8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ushort8__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_ushort8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_2, s7) - 14usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_ushort8__bindgen_ty_3 {
    pub lo: cl_ushort4,
    pub hi: cl_ushort4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort8__bindgen_ty_3"]
        [::std::mem::size_of::<cl_ushort8__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_ushort8__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_ushort8__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_ushort8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ushort8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ushort8__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort8"][::std::mem::size_of::<cl_ushort8>() - 16usize];
    ["Alignment of cl_ushort8"][::std::mem::align_of::<cl_ushort8>() - 16usize];
    ["Offset of field: cl_ushort8::s"][::std::mem::offset_of!(cl_ushort8, s) - 0usize];
    ["Offset of field: cl_ushort8::v4"][::std::mem::offset_of!(cl_ushort8, v4) - 0usize];
    ["Offset of field: cl_ushort8::v8"][::std::mem::offset_of!(cl_ushort8, v8) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_ushort16 {
    pub s: [cl_ushort; 16usize],
    pub __bindgen_anon_1: cl_ushort16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ushort16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ushort16__bindgen_ty_3,
    pub v4: [__cl_ushort4; 4usize],
    pub v8: [__cl_ushort8; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort16__bindgen_ty_1 {
    pub x: cl_ushort,
    pub y: cl_ushort,
    pub z: cl_ushort,
    pub w: cl_ushort,
    pub __spacer4: cl_ushort,
    pub __spacer5: cl_ushort,
    pub __spacer6: cl_ushort,
    pub __spacer7: cl_ushort,
    pub __spacer8: cl_ushort,
    pub __spacer9: cl_ushort,
    pub sa: cl_ushort,
    pub sb: cl_ushort,
    pub sc: cl_ushort,
    pub sd: cl_ushort,
    pub se: cl_ushort,
    pub sf: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_ushort16__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_ushort16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ushort16__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, w) - 6usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer4) - 8usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer5) - 10usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer6) - 12usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer7) - 14usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer8) - 16usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, __spacer9) - 18usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, sa) - 20usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, sb) - 22usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, sc) - 24usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, sd) - 26usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, se) - 28usize];
    ["Offset of field: cl_ushort16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_1, sf) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ushort16__bindgen_ty_2 {
    pub s0: cl_ushort,
    pub s1: cl_ushort,
    pub s2: cl_ushort,
    pub s3: cl_ushort,
    pub s4: cl_ushort,
    pub s5: cl_ushort,
    pub s6: cl_ushort,
    pub s7: cl_ushort,
    pub s8: cl_ushort,
    pub s9: cl_ushort,
    pub sA: cl_ushort,
    pub sB: cl_ushort,
    pub sC: cl_ushort,
    pub sD: cl_ushort,
    pub sE: cl_ushort,
    pub sF: cl_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_ushort16__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_ushort16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ushort16__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s7) - 14usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s8) - 16usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, s9) - 18usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sA) - 20usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sB) - 22usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sC) - 24usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sD) - 26usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sE) - 28usize];
    ["Offset of field: cl_ushort16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_2, sF) - 30usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_ushort16__bindgen_ty_3 {
    pub lo: cl_ushort8,
    pub hi: cl_ushort8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_ushort16__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_ushort16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ushort16__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_ushort16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ushort16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ushort16__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ushort16"][::std::mem::size_of::<cl_ushort16>() - 32usize];
    ["Alignment of cl_ushort16"][::std::mem::align_of::<cl_ushort16>() - 32usize];
    ["Offset of field: cl_ushort16::s"][::std::mem::offset_of!(cl_ushort16, s) - 0usize];
    ["Offset of field: cl_ushort16::v4"][::std::mem::offset_of!(cl_ushort16, v4) - 0usize];
    ["Offset of field: cl_ushort16::v8"][::std::mem::offset_of!(cl_ushort16, v8) - 0usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub union cl_half2 {
    pub s: [cl_half; 2usize],
    pub __bindgen_anon_1: cl_half2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_half2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_half2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half2__bindgen_ty_1 {
    pub x: cl_half,
    pub y: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half2__bindgen_ty_1"][::std::mem::size_of::<cl_half2__bindgen_ty_1>() - 4usize];
    ["Alignment of cl_half2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_half2__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_half2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_half2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_1, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half2__bindgen_ty_2 {
    pub s0: cl_half,
    pub s1: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half2__bindgen_ty_2"][::std::mem::size_of::<cl_half2__bindgen_ty_2>() - 4usize];
    ["Alignment of cl_half2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_half2__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_half2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_half2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_2, s1) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half2__bindgen_ty_3 {
    pub lo: cl_half,
    pub hi: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half2__bindgen_ty_3"][::std::mem::size_of::<cl_half2__bindgen_ty_3>() - 4usize];
    ["Alignment of cl_half2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_half2__bindgen_ty_3>() - 2usize];
    ["Offset of field: cl_half2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_half2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_half2__bindgen_ty_3, hi) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half2"][::std::mem::size_of::<cl_half2>() - 4usize];
    ["Alignment of cl_half2"][::std::mem::align_of::<cl_half2>() - 4usize];
    ["Offset of field: cl_half2::s"][::std::mem::offset_of!(cl_half2, s) - 0usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub union cl_half4 {
    pub s: [cl_half; 4usize],
    pub __bindgen_anon_1: cl_half4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_half4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_half4__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half4__bindgen_ty_1 {
    pub x: cl_half,
    pub y: cl_half,
    pub z: cl_half,
    pub w: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half4__bindgen_ty_1"][::std::mem::size_of::<cl_half4__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_half4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_half4__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_half4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_half4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_half4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_half4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half4__bindgen_ty_2 {
    pub s0: cl_half,
    pub s1: cl_half,
    pub s2: cl_half,
    pub s3: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half4__bindgen_ty_2"][::std::mem::size_of::<cl_half4__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_half4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_half4__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_half4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_half4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_half4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_half4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_2, s3) - 6usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_half4__bindgen_ty_3 {
    pub lo: cl_half2,
    pub hi: cl_half2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half4__bindgen_ty_3"][::std::mem::size_of::<cl_half4__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_half4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_half4__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_half4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_half4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_half4__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half4"][::std::mem::size_of::<cl_half4>() - 8usize];
    ["Alignment of cl_half4"][::std::mem::align_of::<cl_half4>() - 8usize];
    ["Offset of field: cl_half4::s"][::std::mem::offset_of!(cl_half4, s) - 0usize];
};
pub type cl_half3 = cl_half4;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_half8 {
    pub s: [cl_half; 8usize],
    pub __bindgen_anon_1: cl_half8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_half8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_half8__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half8__bindgen_ty_1 {
    pub x: cl_half,
    pub y: cl_half,
    pub z: cl_half,
    pub w: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half8__bindgen_ty_1"][::std::mem::size_of::<cl_half8__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_half8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_half8__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_half8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_half8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_half8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_half8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_1, w) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half8__bindgen_ty_2 {
    pub s0: cl_half,
    pub s1: cl_half,
    pub s2: cl_half,
    pub s3: cl_half,
    pub s4: cl_half,
    pub s5: cl_half,
    pub s6: cl_half,
    pub s7: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half8__bindgen_ty_2"][::std::mem::size_of::<cl_half8__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_half8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_half8__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_half8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_2, s7) - 14usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_half8__bindgen_ty_3 {
    pub lo: cl_half4,
    pub hi: cl_half4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half8__bindgen_ty_3"][::std::mem::size_of::<cl_half8__bindgen_ty_3>() - 16usize];
    ["Alignment of cl_half8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_half8__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_half8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_half8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_half8__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half8"][::std::mem::size_of::<cl_half8>() - 16usize];
    ["Alignment of cl_half8"][::std::mem::align_of::<cl_half8>() - 16usize];
    ["Offset of field: cl_half8::s"][::std::mem::offset_of!(cl_half8, s) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_half16 {
    pub s: [cl_half; 16usize],
    pub __bindgen_anon_1: cl_half16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_half16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_half16__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half16__bindgen_ty_1 {
    pub x: cl_half,
    pub y: cl_half,
    pub z: cl_half,
    pub w: cl_half,
    pub __spacer4: cl_half,
    pub __spacer5: cl_half,
    pub __spacer6: cl_half,
    pub __spacer7: cl_half,
    pub __spacer8: cl_half,
    pub __spacer9: cl_half,
    pub sa: cl_half,
    pub sb: cl_half,
    pub sc: cl_half,
    pub sd: cl_half,
    pub se: cl_half,
    pub sf: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half16__bindgen_ty_1"][::std::mem::size_of::<cl_half16__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_half16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_half16__bindgen_ty_1>() - 2usize];
    ["Offset of field: cl_half16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_half16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, y) - 2usize];
    ["Offset of field: cl_half16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, z) - 4usize];
    ["Offset of field: cl_half16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, w) - 6usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer4) - 8usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer5) - 10usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer6) - 12usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer7) - 14usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer8) - 16usize];
    ["Offset of field: cl_half16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, __spacer9) - 18usize];
    ["Offset of field: cl_half16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, sa) - 20usize];
    ["Offset of field: cl_half16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, sb) - 22usize];
    ["Offset of field: cl_half16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, sc) - 24usize];
    ["Offset of field: cl_half16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, sd) - 26usize];
    ["Offset of field: cl_half16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, se) - 28usize];
    ["Offset of field: cl_half16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_1, sf) - 30usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_half16__bindgen_ty_2 {
    pub s0: cl_half,
    pub s1: cl_half,
    pub s2: cl_half,
    pub s3: cl_half,
    pub s4: cl_half,
    pub s5: cl_half,
    pub s6: cl_half,
    pub s7: cl_half,
    pub s8: cl_half,
    pub s9: cl_half,
    pub sA: cl_half,
    pub sB: cl_half,
    pub sC: cl_half,
    pub sD: cl_half,
    pub sE: cl_half,
    pub sF: cl_half,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half16__bindgen_ty_2"][::std::mem::size_of::<cl_half16__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_half16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_half16__bindgen_ty_2>() - 2usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s1) - 2usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s2) - 4usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s3) - 6usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s4) - 8usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s5) - 10usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s6) - 12usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s7) - 14usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s8) - 16usize];
    ["Offset of field: cl_half16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, s9) - 18usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sA) - 20usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sB) - 22usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sC) - 24usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sD) - 26usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sE) - 28usize];
    ["Offset of field: cl_half16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_2, sF) - 30usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_half16__bindgen_ty_3 {
    pub lo: cl_half8,
    pub hi: cl_half8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half16__bindgen_ty_3"][::std::mem::size_of::<cl_half16__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_half16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_half16__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_half16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_half16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_half16__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_half16"][::std::mem::size_of::<cl_half16>() - 32usize];
    ["Alignment of cl_half16"][::std::mem::align_of::<cl_half16>() - 32usize];
    ["Offset of field: cl_half16::s"][::std::mem::offset_of!(cl_half16, s) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_int2 {
    pub s: [cl_int; 2usize],
    pub __bindgen_anon_1: cl_int2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_int2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_int2__bindgen_ty_3,
    pub v2: __cl_int2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int2__bindgen_ty_1 {
    pub x: cl_int,
    pub y: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int2__bindgen_ty_1"][::std::mem::size_of::<cl_int2__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_int2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_int2__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_int2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_int2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_1, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int2__bindgen_ty_2 {
    pub s0: cl_int,
    pub s1: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int2__bindgen_ty_2"][::std::mem::size_of::<cl_int2__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_int2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_int2__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_int2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_int2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_2, s1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int2__bindgen_ty_3 {
    pub lo: cl_int,
    pub hi: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int2__bindgen_ty_3"][::std::mem::size_of::<cl_int2__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_int2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_int2__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_int2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_int2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_int2__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int2"][::std::mem::size_of::<cl_int2>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_int2"][::std::mem::align_of::<cl_int2>() - 8usize];
    ["Offset of field: cl_int2::s"][::std::mem::offset_of!(cl_int2, s) - 0usize];
    ["Offset of field: cl_int2::v2"][::std::mem::offset_of!(cl_int2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_int4 {
    pub s: [cl_int; 4usize],
    pub __bindgen_anon_1: cl_int4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_int4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_int4__bindgen_ty_3,
    pub v2: [__cl_int2; 2usize],
    pub v4: __cl_int4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int4__bindgen_ty_1 {
    pub x: cl_int,
    pub y: cl_int,
    pub z: cl_int,
    pub w: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int4__bindgen_ty_1"][::std::mem::size_of::<cl_int4__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_int4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_int4__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_int4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_int4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_int4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_int4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int4__bindgen_ty_2 {
    pub s0: cl_int,
    pub s1: cl_int,
    pub s2: cl_int,
    pub s3: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int4__bindgen_ty_2"][::std::mem::size_of::<cl_int4__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_int4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_int4__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_int4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_int4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_int4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_int4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_2, s3) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_int4__bindgen_ty_3 {
    pub lo: cl_int2,
    pub hi: cl_int2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int4__bindgen_ty_3"][::std::mem::size_of::<cl_int4__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_int4__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_int4__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_int4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_int4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_int4__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int4"][::std::mem::size_of::<cl_int4>() - 16usize];
    ["Alignment of cl_int4"][::std::mem::align_of::<cl_int4>() - 16usize];
    ["Offset of field: cl_int4::s"][::std::mem::offset_of!(cl_int4, s) - 0usize];
    ["Offset of field: cl_int4::v2"][::std::mem::offset_of!(cl_int4, v2) - 0usize];
    ["Offset of field: cl_int4::v4"][::std::mem::offset_of!(cl_int4, v4) - 0usize];
};
pub type cl_int3 = cl_int4;
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_int8 {
    pub s: [cl_int; 8usize],
    pub __bindgen_anon_1: cl_int8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_int8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_int8__bindgen_ty_3,
    pub v2: [__cl_int2; 4usize],
    pub v4: [__cl_int4; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int8__bindgen_ty_1 {
    pub x: cl_int,
    pub y: cl_int,
    pub z: cl_int,
    pub w: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int8__bindgen_ty_1"][::std::mem::size_of::<cl_int8__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_int8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_int8__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_int8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_int8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_int8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_int8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int8__bindgen_ty_2 {
    pub s0: cl_int,
    pub s1: cl_int,
    pub s2: cl_int,
    pub s3: cl_int,
    pub s4: cl_int,
    pub s5: cl_int,
    pub s6: cl_int,
    pub s7: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int8__bindgen_ty_2"][::std::mem::size_of::<cl_int8__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_int8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_int8__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_int8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_2, s7) - 28usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_int8__bindgen_ty_3 {
    pub lo: cl_int4,
    pub hi: cl_int4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int8__bindgen_ty_3"][::std::mem::size_of::<cl_int8__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_int8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_int8__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_int8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_int8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_int8__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int8"][::std::mem::size_of::<cl_int8>() - 32usize];
    ["Alignment of cl_int8"][::std::mem::align_of::<cl_int8>() - 32usize];
    ["Offset of field: cl_int8::s"][::std::mem::offset_of!(cl_int8, s) - 0usize];
    ["Offset of field: cl_int8::v2"][::std::mem::offset_of!(cl_int8, v2) - 0usize];
    ["Offset of field: cl_int8::v4"][::std::mem::offset_of!(cl_int8, v4) - 0usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_int16 {
    pub s: [cl_int; 16usize],
    pub __bindgen_anon_1: cl_int16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_int16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_int16__bindgen_ty_3,
    pub v2: [__cl_int2; 8usize],
    pub v4: [__cl_int4; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int16__bindgen_ty_1 {
    pub x: cl_int,
    pub y: cl_int,
    pub z: cl_int,
    pub w: cl_int,
    pub __spacer4: cl_int,
    pub __spacer5: cl_int,
    pub __spacer6: cl_int,
    pub __spacer7: cl_int,
    pub __spacer8: cl_int,
    pub __spacer9: cl_int,
    pub sa: cl_int,
    pub sb: cl_int,
    pub sc: cl_int,
    pub sd: cl_int,
    pub se: cl_int,
    pub sf: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int16__bindgen_ty_1"][::std::mem::size_of::<cl_int16__bindgen_ty_1>() - 64usize];
    ["Alignment of cl_int16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_int16__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_int16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_int16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_int16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_int16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, w) - 12usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer4) - 16usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer5) - 20usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer6) - 24usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer7) - 28usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer8) - 32usize];
    ["Offset of field: cl_int16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, __spacer9) - 36usize];
    ["Offset of field: cl_int16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, sa) - 40usize];
    ["Offset of field: cl_int16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, sb) - 44usize];
    ["Offset of field: cl_int16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, sc) - 48usize];
    ["Offset of field: cl_int16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, sd) - 52usize];
    ["Offset of field: cl_int16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, se) - 56usize];
    ["Offset of field: cl_int16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_1, sf) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_int16__bindgen_ty_2 {
    pub s0: cl_int,
    pub s1: cl_int,
    pub s2: cl_int,
    pub s3: cl_int,
    pub s4: cl_int,
    pub s5: cl_int,
    pub s6: cl_int,
    pub s7: cl_int,
    pub s8: cl_int,
    pub s9: cl_int,
    pub sA: cl_int,
    pub sB: cl_int,
    pub sC: cl_int,
    pub sD: cl_int,
    pub sE: cl_int,
    pub sF: cl_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int16__bindgen_ty_2"][::std::mem::size_of::<cl_int16__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_int16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_int16__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s7) - 28usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s8) - 32usize];
    ["Offset of field: cl_int16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, s9) - 36usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sA) - 40usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sB) - 44usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sC) - 48usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sD) - 52usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sE) - 56usize];
    ["Offset of field: cl_int16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_2, sF) - 60usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_int16__bindgen_ty_3 {
    pub lo: cl_int8,
    pub hi: cl_int8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int16__bindgen_ty_3"][::std::mem::size_of::<cl_int16__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_int16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_int16__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_int16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_int16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_int16__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_int16"][::std::mem::size_of::<cl_int16>() - 64usize];
    ["Alignment of cl_int16"][::std::mem::align_of::<cl_int16>() - 64usize];
    ["Offset of field: cl_int16::s"][::std::mem::offset_of!(cl_int16, s) - 0usize];
    ["Offset of field: cl_int16::v2"][::std::mem::offset_of!(cl_int16, v2) - 0usize];
    ["Offset of field: cl_int16::v4"][::std::mem::offset_of!(cl_int16, v4) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_uint2 {
    pub s: [cl_uint; 2usize],
    pub __bindgen_anon_1: cl_uint2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uint2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uint2__bindgen_ty_3,
    pub v2: __cl_uint2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint2__bindgen_ty_1 {
    pub x: cl_uint,
    pub y: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint2__bindgen_ty_1"][::std::mem::size_of::<cl_uint2__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_uint2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uint2__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_uint2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uint2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_1, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint2__bindgen_ty_2 {
    pub s0: cl_uint,
    pub s1: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint2__bindgen_ty_2"][::std::mem::size_of::<cl_uint2__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_uint2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uint2__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_uint2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uint2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_2, s1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint2__bindgen_ty_3 {
    pub lo: cl_uint,
    pub hi: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint2__bindgen_ty_3"][::std::mem::size_of::<cl_uint2__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_uint2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uint2__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_uint2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uint2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uint2__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint2"][::std::mem::size_of::<cl_uint2>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_uint2"][::std::mem::align_of::<cl_uint2>() - 8usize];
    ["Offset of field: cl_uint2::s"][::std::mem::offset_of!(cl_uint2, s) - 0usize];
    ["Offset of field: cl_uint2::v2"][::std::mem::offset_of!(cl_uint2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_uint4 {
    pub s: [cl_uint; 4usize],
    pub __bindgen_anon_1: cl_uint4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uint4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uint4__bindgen_ty_3,
    pub v2: [__cl_uint2; 2usize],
    pub v4: __cl_uint4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint4__bindgen_ty_1 {
    pub x: cl_uint,
    pub y: cl_uint,
    pub z: cl_uint,
    pub w: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint4__bindgen_ty_1"][::std::mem::size_of::<cl_uint4__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_uint4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uint4__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_uint4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uint4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_uint4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_uint4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint4__bindgen_ty_2 {
    pub s0: cl_uint,
    pub s1: cl_uint,
    pub s2: cl_uint,
    pub s3: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint4__bindgen_ty_2"][::std::mem::size_of::<cl_uint4__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_uint4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uint4__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_uint4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uint4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_uint4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_uint4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_2, s3) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_uint4__bindgen_ty_3 {
    pub lo: cl_uint2,
    pub hi: cl_uint2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint4__bindgen_ty_3"][::std::mem::size_of::<cl_uint4__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_uint4__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_uint4__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_uint4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uint4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uint4__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint4"][::std::mem::size_of::<cl_uint4>() - 16usize];
    ["Alignment of cl_uint4"][::std::mem::align_of::<cl_uint4>() - 16usize];
    ["Offset of field: cl_uint4::s"][::std::mem::offset_of!(cl_uint4, s) - 0usize];
    ["Offset of field: cl_uint4::v2"][::std::mem::offset_of!(cl_uint4, v2) - 0usize];
    ["Offset of field: cl_uint4::v4"][::std::mem::offset_of!(cl_uint4, v4) - 0usize];
};
pub type cl_uint3 = cl_uint4;
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_uint8 {
    pub s: [cl_uint; 8usize],
    pub __bindgen_anon_1: cl_uint8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uint8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uint8__bindgen_ty_3,
    pub v2: [__cl_uint2; 4usize],
    pub v4: [__cl_uint4; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint8__bindgen_ty_1 {
    pub x: cl_uint,
    pub y: cl_uint,
    pub z: cl_uint,
    pub w: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint8__bindgen_ty_1"][::std::mem::size_of::<cl_uint8__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_uint8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uint8__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_uint8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uint8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_uint8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_uint8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint8__bindgen_ty_2 {
    pub s0: cl_uint,
    pub s1: cl_uint,
    pub s2: cl_uint,
    pub s3: cl_uint,
    pub s4: cl_uint,
    pub s5: cl_uint,
    pub s6: cl_uint,
    pub s7: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint8__bindgen_ty_2"][::std::mem::size_of::<cl_uint8__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_uint8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uint8__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_uint8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_2, s7) - 28usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_uint8__bindgen_ty_3 {
    pub lo: cl_uint4,
    pub hi: cl_uint4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint8__bindgen_ty_3"][::std::mem::size_of::<cl_uint8__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_uint8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uint8__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_uint8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uint8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uint8__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint8"][::std::mem::size_of::<cl_uint8>() - 32usize];
    ["Alignment of cl_uint8"][::std::mem::align_of::<cl_uint8>() - 32usize];
    ["Offset of field: cl_uint8::s"][::std::mem::offset_of!(cl_uint8, s) - 0usize];
    ["Offset of field: cl_uint8::v2"][::std::mem::offset_of!(cl_uint8, v2) - 0usize];
    ["Offset of field: cl_uint8::v4"][::std::mem::offset_of!(cl_uint8, v4) - 0usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_uint16 {
    pub s: [cl_uint; 16usize],
    pub __bindgen_anon_1: cl_uint16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_uint16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_uint16__bindgen_ty_3,
    pub v2: [__cl_uint2; 8usize],
    pub v4: [__cl_uint4; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint16__bindgen_ty_1 {
    pub x: cl_uint,
    pub y: cl_uint,
    pub z: cl_uint,
    pub w: cl_uint,
    pub __spacer4: cl_uint,
    pub __spacer5: cl_uint,
    pub __spacer6: cl_uint,
    pub __spacer7: cl_uint,
    pub __spacer8: cl_uint,
    pub __spacer9: cl_uint,
    pub sa: cl_uint,
    pub sb: cl_uint,
    pub sc: cl_uint,
    pub sd: cl_uint,
    pub se: cl_uint,
    pub sf: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint16__bindgen_ty_1"][::std::mem::size_of::<cl_uint16__bindgen_ty_1>() - 64usize];
    ["Alignment of cl_uint16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_uint16__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, w) - 12usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer4) - 16usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer5) - 20usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer6) - 24usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer7) - 28usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer8) - 32usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, __spacer9) - 36usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, sa) - 40usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, sb) - 44usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, sc) - 48usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, sd) - 52usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, se) - 56usize];
    ["Offset of field: cl_uint16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_1, sf) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_uint16__bindgen_ty_2 {
    pub s0: cl_uint,
    pub s1: cl_uint,
    pub s2: cl_uint,
    pub s3: cl_uint,
    pub s4: cl_uint,
    pub s5: cl_uint,
    pub s6: cl_uint,
    pub s7: cl_uint,
    pub s8: cl_uint,
    pub s9: cl_uint,
    pub sA: cl_uint,
    pub sB: cl_uint,
    pub sC: cl_uint,
    pub sD: cl_uint,
    pub sE: cl_uint,
    pub sF: cl_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint16__bindgen_ty_2"][::std::mem::size_of::<cl_uint16__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_uint16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_uint16__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s7) - 28usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s8) - 32usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, s9) - 36usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sA) - 40usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sB) - 44usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sC) - 48usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sD) - 52usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sE) - 56usize];
    ["Offset of field: cl_uint16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_2, sF) - 60usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_uint16__bindgen_ty_3 {
    pub lo: cl_uint8,
    pub hi: cl_uint8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint16__bindgen_ty_3"][::std::mem::size_of::<cl_uint16__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_uint16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_uint16__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_uint16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_uint16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_uint16__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_uint16"][::std::mem::size_of::<cl_uint16>() - 64usize];
    ["Alignment of cl_uint16"][::std::mem::align_of::<cl_uint16>() - 64usize];
    ["Offset of field: cl_uint16::s"][::std::mem::offset_of!(cl_uint16, s) - 0usize];
    ["Offset of field: cl_uint16::v2"][::std::mem::offset_of!(cl_uint16, v2) - 0usize];
    ["Offset of field: cl_uint16::v4"][::std::mem::offset_of!(cl_uint16, v4) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_long2 {
    pub s: [cl_long; 2usize],
    pub __bindgen_anon_1: cl_long2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_long2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_long2__bindgen_ty_3,
    pub v2: __cl_long2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long2__bindgen_ty_1 {
    pub x: cl_long,
    pub y: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long2__bindgen_ty_1"][::std::mem::size_of::<cl_long2__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_long2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_long2__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_long2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_long2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_1, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long2__bindgen_ty_2 {
    pub s0: cl_long,
    pub s1: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long2__bindgen_ty_2"][::std::mem::size_of::<cl_long2__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_long2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_long2__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_long2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_long2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_2, s1) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long2__bindgen_ty_3 {
    pub lo: cl_long,
    pub hi: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long2__bindgen_ty_3"][::std::mem::size_of::<cl_long2__bindgen_ty_3>() - 16usize];
    ["Alignment of cl_long2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_long2__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_long2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_long2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_long2__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long2"][::std::mem::size_of::<cl_long2>() - 16usize];
    ["Alignment of cl_long2"][::std::mem::align_of::<cl_long2>() - 16usize];
    ["Offset of field: cl_long2::s"][::std::mem::offset_of!(cl_long2, s) - 0usize];
    ["Offset of field: cl_long2::v2"][::std::mem::offset_of!(cl_long2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_long4 {
    pub s: [cl_long; 4usize],
    pub __bindgen_anon_1: cl_long4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_long4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_long4__bindgen_ty_3,
    pub v2: [__cl_long2; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long4__bindgen_ty_1 {
    pub x: cl_long,
    pub y: cl_long,
    pub z: cl_long,
    pub w: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long4__bindgen_ty_1"][::std::mem::size_of::<cl_long4__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_long4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_long4__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_long4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_long4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_long4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_long4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long4__bindgen_ty_2 {
    pub s0: cl_long,
    pub s1: cl_long,
    pub s2: cl_long,
    pub s3: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long4__bindgen_ty_2"][::std::mem::size_of::<cl_long4__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_long4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_long4__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_long4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_long4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_long4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_long4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_2, s3) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_long4__bindgen_ty_3 {
    pub lo: cl_long2,
    pub hi: cl_long2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long4__bindgen_ty_3"][::std::mem::size_of::<cl_long4__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_long4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_long4__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_long4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_long4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_long4__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long4"][::std::mem::size_of::<cl_long4>() - 32usize];
    ["Alignment of cl_long4"][::std::mem::align_of::<cl_long4>() - 32usize];
    ["Offset of field: cl_long4::s"][::std::mem::offset_of!(cl_long4, s) - 0usize];
    ["Offset of field: cl_long4::v2"][::std::mem::offset_of!(cl_long4, v2) - 0usize];
};
pub type cl_long3 = cl_long4;
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_long8 {
    pub s: [cl_long; 8usize],
    pub __bindgen_anon_1: cl_long8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_long8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_long8__bindgen_ty_3,
    pub v2: [__cl_long2; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long8__bindgen_ty_1 {
    pub x: cl_long,
    pub y: cl_long,
    pub z: cl_long,
    pub w: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long8__bindgen_ty_1"][::std::mem::size_of::<cl_long8__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_long8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_long8__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_long8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_long8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_long8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_long8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long8__bindgen_ty_2 {
    pub s0: cl_long,
    pub s1: cl_long,
    pub s2: cl_long,
    pub s3: cl_long,
    pub s4: cl_long,
    pub s5: cl_long,
    pub s6: cl_long,
    pub s7: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long8__bindgen_ty_2"][::std::mem::size_of::<cl_long8__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_long8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_long8__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_long8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_2, s7) - 56usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_long8__bindgen_ty_3 {
    pub lo: cl_long4,
    pub hi: cl_long4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long8__bindgen_ty_3"][::std::mem::size_of::<cl_long8__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_long8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_long8__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_long8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_long8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_long8__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long8"][::std::mem::size_of::<cl_long8>() - 64usize];
    ["Alignment of cl_long8"][::std::mem::align_of::<cl_long8>() - 64usize];
    ["Offset of field: cl_long8::s"][::std::mem::offset_of!(cl_long8, s) - 0usize];
    ["Offset of field: cl_long8::v2"][::std::mem::offset_of!(cl_long8, v2) - 0usize];
};
#[repr(C)]
#[repr(align(128))]
#[derive(Copy, Clone)]
pub union cl_long16 {
    pub s: [cl_long; 16usize],
    pub __bindgen_anon_1: cl_long16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_long16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_long16__bindgen_ty_3,
    pub v2: [__cl_long2; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long16__bindgen_ty_1 {
    pub x: cl_long,
    pub y: cl_long,
    pub z: cl_long,
    pub w: cl_long,
    pub __spacer4: cl_long,
    pub __spacer5: cl_long,
    pub __spacer6: cl_long,
    pub __spacer7: cl_long,
    pub __spacer8: cl_long,
    pub __spacer9: cl_long,
    pub sa: cl_long,
    pub sb: cl_long,
    pub sc: cl_long,
    pub sd: cl_long,
    pub se: cl_long,
    pub sf: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_long16__bindgen_ty_1>() - 128usize];
    ["Alignment of cl_long16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_long16__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_long16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_long16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_long16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_long16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, w) - 24usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer4) - 32usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer5) - 40usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer6) - 48usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer7) - 56usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer8) - 64usize];
    ["Offset of field: cl_long16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, __spacer9) - 72usize];
    ["Offset of field: cl_long16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, sa) - 80usize];
    ["Offset of field: cl_long16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, sb) - 88usize];
    ["Offset of field: cl_long16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, sc) - 96usize];
    ["Offset of field: cl_long16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, sd) - 104usize];
    ["Offset of field: cl_long16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, se) - 112usize];
    ["Offset of field: cl_long16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_1, sf) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_long16__bindgen_ty_2 {
    pub s0: cl_long,
    pub s1: cl_long,
    pub s2: cl_long,
    pub s3: cl_long,
    pub s4: cl_long,
    pub s5: cl_long,
    pub s6: cl_long,
    pub s7: cl_long,
    pub s8: cl_long,
    pub s9: cl_long,
    pub sA: cl_long,
    pub sB: cl_long,
    pub sC: cl_long,
    pub sD: cl_long,
    pub sE: cl_long,
    pub sF: cl_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_long16__bindgen_ty_2>() - 128usize];
    ["Alignment of cl_long16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_long16__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s7) - 56usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s8) - 64usize];
    ["Offset of field: cl_long16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, s9) - 72usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sA) - 80usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sB) - 88usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sC) - 96usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sD) - 104usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sE) - 112usize];
    ["Offset of field: cl_long16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_2, sF) - 120usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct cl_long16__bindgen_ty_3 {
    pub lo: cl_long8,
    pub hi: cl_long8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_long16__bindgen_ty_3>() - 128usize];
    ["Alignment of cl_long16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_long16__bindgen_ty_3>() - 64usize];
    ["Offset of field: cl_long16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_long16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_long16__bindgen_ty_3, hi) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_long16"][::std::mem::size_of::<cl_long16>() - 128usize];
    ["Alignment of cl_long16"][::std::mem::align_of::<cl_long16>() - 128usize];
    ["Offset of field: cl_long16::s"][::std::mem::offset_of!(cl_long16, s) - 0usize];
    ["Offset of field: cl_long16::v2"][::std::mem::offset_of!(cl_long16, v2) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_ulong2 {
    pub s: [cl_ulong; 2usize],
    pub __bindgen_anon_1: cl_ulong2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ulong2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ulong2__bindgen_ty_3,
    pub v2: __cl_ulong2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong2__bindgen_ty_1 {
    pub x: cl_ulong,
    pub y: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong2__bindgen_ty_1"][::std::mem::size_of::<cl_ulong2__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_ulong2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ulong2__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_ulong2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ulong2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_1, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong2__bindgen_ty_2 {
    pub s0: cl_ulong,
    pub s1: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong2__bindgen_ty_2"][::std::mem::size_of::<cl_ulong2__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_ulong2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ulong2__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_ulong2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ulong2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_2, s1) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong2__bindgen_ty_3 {
    pub lo: cl_ulong,
    pub hi: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong2__bindgen_ty_3"][::std::mem::size_of::<cl_ulong2__bindgen_ty_3>() - 16usize];
    ["Alignment of cl_ulong2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ulong2__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_ulong2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ulong2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ulong2__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong2"][::std::mem::size_of::<cl_ulong2>() - 16usize];
    ["Alignment of cl_ulong2"][::std::mem::align_of::<cl_ulong2>() - 16usize];
    ["Offset of field: cl_ulong2::s"][::std::mem::offset_of!(cl_ulong2, s) - 0usize];
    ["Offset of field: cl_ulong2::v2"][::std::mem::offset_of!(cl_ulong2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_ulong4 {
    pub s: [cl_ulong; 4usize],
    pub __bindgen_anon_1: cl_ulong4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ulong4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ulong4__bindgen_ty_3,
    pub v2: [__cl_ulong2; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong4__bindgen_ty_1 {
    pub x: cl_ulong,
    pub y: cl_ulong,
    pub z: cl_ulong,
    pub w: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong4__bindgen_ty_1"][::std::mem::size_of::<cl_ulong4__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_ulong4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ulong4__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_ulong4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ulong4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_ulong4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_ulong4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong4__bindgen_ty_2 {
    pub s0: cl_ulong,
    pub s1: cl_ulong,
    pub s2: cl_ulong,
    pub s3: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong4__bindgen_ty_2"][::std::mem::size_of::<cl_ulong4__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_ulong4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ulong4__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_ulong4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ulong4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_ulong4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_ulong4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_2, s3) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_ulong4__bindgen_ty_3 {
    pub lo: cl_ulong2,
    pub hi: cl_ulong2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong4__bindgen_ty_3"][::std::mem::size_of::<cl_ulong4__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_ulong4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ulong4__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_ulong4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ulong4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ulong4__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong4"][::std::mem::size_of::<cl_ulong4>() - 32usize];
    ["Alignment of cl_ulong4"][::std::mem::align_of::<cl_ulong4>() - 32usize];
    ["Offset of field: cl_ulong4::s"][::std::mem::offset_of!(cl_ulong4, s) - 0usize];
    ["Offset of field: cl_ulong4::v2"][::std::mem::offset_of!(cl_ulong4, v2) - 0usize];
};
pub type cl_ulong3 = cl_ulong4;
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_ulong8 {
    pub s: [cl_ulong; 8usize],
    pub __bindgen_anon_1: cl_ulong8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ulong8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ulong8__bindgen_ty_3,
    pub v2: [__cl_ulong2; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong8__bindgen_ty_1 {
    pub x: cl_ulong,
    pub y: cl_ulong,
    pub z: cl_ulong,
    pub w: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong8__bindgen_ty_1"][::std::mem::size_of::<cl_ulong8__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_ulong8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ulong8__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_ulong8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ulong8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_ulong8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_ulong8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong8__bindgen_ty_2 {
    pub s0: cl_ulong,
    pub s1: cl_ulong,
    pub s2: cl_ulong,
    pub s3: cl_ulong,
    pub s4: cl_ulong,
    pub s5: cl_ulong,
    pub s6: cl_ulong,
    pub s7: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong8__bindgen_ty_2"][::std::mem::size_of::<cl_ulong8__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_ulong8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ulong8__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_ulong8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_2, s7) - 56usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_ulong8__bindgen_ty_3 {
    pub lo: cl_ulong4,
    pub hi: cl_ulong4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong8__bindgen_ty_3"][::std::mem::size_of::<cl_ulong8__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_ulong8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ulong8__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_ulong8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ulong8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ulong8__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong8"][::std::mem::size_of::<cl_ulong8>() - 64usize];
    ["Alignment of cl_ulong8"][::std::mem::align_of::<cl_ulong8>() - 64usize];
    ["Offset of field: cl_ulong8::s"][::std::mem::offset_of!(cl_ulong8, s) - 0usize];
    ["Offset of field: cl_ulong8::v2"][::std::mem::offset_of!(cl_ulong8, v2) - 0usize];
};
#[repr(C)]
#[repr(align(128))]
#[derive(Copy, Clone)]
pub union cl_ulong16 {
    pub s: [cl_ulong; 16usize],
    pub __bindgen_anon_1: cl_ulong16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_ulong16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_ulong16__bindgen_ty_3,
    pub v2: [__cl_ulong2; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong16__bindgen_ty_1 {
    pub x: cl_ulong,
    pub y: cl_ulong,
    pub z: cl_ulong,
    pub w: cl_ulong,
    pub __spacer4: cl_ulong,
    pub __spacer5: cl_ulong,
    pub __spacer6: cl_ulong,
    pub __spacer7: cl_ulong,
    pub __spacer8: cl_ulong,
    pub __spacer9: cl_ulong,
    pub sa: cl_ulong,
    pub sb: cl_ulong,
    pub sc: cl_ulong,
    pub sd: cl_ulong,
    pub se: cl_ulong,
    pub sf: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_ulong16__bindgen_ty_1>() - 128usize];
    ["Alignment of cl_ulong16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_ulong16__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, w) - 24usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer4) - 32usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer5) - 40usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer6) - 48usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer7) - 56usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer8) - 64usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, __spacer9) - 72usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, sa) - 80usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, sb) - 88usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, sc) - 96usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, sd) - 104usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, se) - 112usize];
    ["Offset of field: cl_ulong16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_1, sf) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_ulong16__bindgen_ty_2 {
    pub s0: cl_ulong,
    pub s1: cl_ulong,
    pub s2: cl_ulong,
    pub s3: cl_ulong,
    pub s4: cl_ulong,
    pub s5: cl_ulong,
    pub s6: cl_ulong,
    pub s7: cl_ulong,
    pub s8: cl_ulong,
    pub s9: cl_ulong,
    pub sA: cl_ulong,
    pub sB: cl_ulong,
    pub sC: cl_ulong,
    pub sD: cl_ulong,
    pub sE: cl_ulong,
    pub sF: cl_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_ulong16__bindgen_ty_2>() - 128usize];
    ["Alignment of cl_ulong16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_ulong16__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s7) - 56usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s8) - 64usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, s9) - 72usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sA) - 80usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sB) - 88usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sC) - 96usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sD) - 104usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sE) - 112usize];
    ["Offset of field: cl_ulong16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_2, sF) - 120usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct cl_ulong16__bindgen_ty_3 {
    pub lo: cl_ulong8,
    pub hi: cl_ulong8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_ulong16__bindgen_ty_3>() - 128usize];
    ["Alignment of cl_ulong16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_ulong16__bindgen_ty_3>() - 64usize];
    ["Offset of field: cl_ulong16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_ulong16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_ulong16__bindgen_ty_3, hi) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_ulong16"][::std::mem::size_of::<cl_ulong16>() - 128usize];
    ["Alignment of cl_ulong16"][::std::mem::align_of::<cl_ulong16>() - 128usize];
    ["Offset of field: cl_ulong16::s"][::std::mem::offset_of!(cl_ulong16, s) - 0usize];
    ["Offset of field: cl_ulong16::v2"][::std::mem::offset_of!(cl_ulong16, v2) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cl_float2 {
    pub s: [cl_float; 2usize],
    pub __bindgen_anon_1: cl_float2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_float2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_float2__bindgen_ty_3,
    pub v2: __cl_float2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_1 {
    pub x: cl_float,
    pub y: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_1"][::std::mem::size_of::<cl_float2__bindgen_ty_1>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_1, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_2 {
    pub s0: cl_float,
    pub s1: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_2"][::std::mem::size_of::<cl_float2__bindgen_ty_2>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_2, s1) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float2__bindgen_ty_3 {
    pub lo: cl_float,
    pub hi: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2__bindgen_ty_3"][::std::mem::size_of::<cl_float2__bindgen_ty_3>() - 8usize];
    ["Alignment of cl_float2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_float2__bindgen_ty_3>() - 4usize];
    ["Offset of field: cl_float2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_float2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_float2__bindgen_ty_3, hi) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float2"][::std::mem::size_of::<cl_float2>() - 8usize];
    // FIXME bindings generation
    // ["Alignment of cl_float2"][::std::mem::align_of::<cl_float2>() - 8usize];
    ["Offset of field: cl_float2::s"][::std::mem::offset_of!(cl_float2, s) - 0usize];
    ["Offset of field: cl_float2::v2"][::std::mem::offset_of!(cl_float2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_float4 {
    pub s: [cl_float; 4usize],
    pub __bindgen_anon_1: cl_float4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_float4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_float4__bindgen_ty_3,
    pub v2: [__cl_float2; 2usize],
    pub v4: __cl_float4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float4__bindgen_ty_1 {
    pub x: cl_float,
    pub y: cl_float,
    pub z: cl_float,
    pub w: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float4__bindgen_ty_1"][::std::mem::size_of::<cl_float4__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_float4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_float4__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_float4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_float4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_float4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_float4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float4__bindgen_ty_2 {
    pub s0: cl_float,
    pub s1: cl_float,
    pub s2: cl_float,
    pub s3: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float4__bindgen_ty_2"][::std::mem::size_of::<cl_float4__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_float4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_float4__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_float4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_float4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_float4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_float4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_2, s3) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cl_float4__bindgen_ty_3 {
    pub lo: cl_float2,
    pub hi: cl_float2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float4__bindgen_ty_3"][::std::mem::size_of::<cl_float4__bindgen_ty_3>() - 16usize];
    // FIXME bindings generation
    // ["Alignment of cl_float4__bindgen_ty_3"]
    //     [::std::mem::align_of::<cl_float4__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_float4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_float4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_float4__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float4"][::std::mem::size_of::<cl_float4>() - 16usize];
    ["Alignment of cl_float4"][::std::mem::align_of::<cl_float4>() - 16usize];
    ["Offset of field: cl_float4::s"][::std::mem::offset_of!(cl_float4, s) - 0usize];
    ["Offset of field: cl_float4::v2"][::std::mem::offset_of!(cl_float4, v2) - 0usize];
    ["Offset of field: cl_float4::v4"][::std::mem::offset_of!(cl_float4, v4) - 0usize];
};
pub type cl_float3 = cl_float4;
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_float8 {
    pub s: [cl_float; 8usize],
    pub __bindgen_anon_1: cl_float8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_float8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_float8__bindgen_ty_3,
    pub v2: [__cl_float2; 4usize],
    pub v4: [__cl_float4; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float8__bindgen_ty_1 {
    pub x: cl_float,
    pub y: cl_float,
    pub z: cl_float,
    pub w: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float8__bindgen_ty_1"][::std::mem::size_of::<cl_float8__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_float8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_float8__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_float8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_float8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_float8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_float8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_1, w) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float8__bindgen_ty_2 {
    pub s0: cl_float,
    pub s1: cl_float,
    pub s2: cl_float,
    pub s3: cl_float,
    pub s4: cl_float,
    pub s5: cl_float,
    pub s6: cl_float,
    pub s7: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float8__bindgen_ty_2"][::std::mem::size_of::<cl_float8__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_float8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_float8__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_float8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_2, s7) - 28usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_float8__bindgen_ty_3 {
    pub lo: cl_float4,
    pub hi: cl_float4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float8__bindgen_ty_3"][::std::mem::size_of::<cl_float8__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_float8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_float8__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_float8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_float8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_float8__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float8"][::std::mem::size_of::<cl_float8>() - 32usize];
    ["Alignment of cl_float8"][::std::mem::align_of::<cl_float8>() - 32usize];
    ["Offset of field: cl_float8::s"][::std::mem::offset_of!(cl_float8, s) - 0usize];
    ["Offset of field: cl_float8::v2"][::std::mem::offset_of!(cl_float8, v2) - 0usize];
    ["Offset of field: cl_float8::v4"][::std::mem::offset_of!(cl_float8, v4) - 0usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_float16 {
    pub s: [cl_float; 16usize],
    pub __bindgen_anon_1: cl_float16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_float16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_float16__bindgen_ty_3,
    pub v2: [__cl_float2; 8usize],
    pub v4: [__cl_float4; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float16__bindgen_ty_1 {
    pub x: cl_float,
    pub y: cl_float,
    pub z: cl_float,
    pub w: cl_float,
    pub __spacer4: cl_float,
    pub __spacer5: cl_float,
    pub __spacer6: cl_float,
    pub __spacer7: cl_float,
    pub __spacer8: cl_float,
    pub __spacer9: cl_float,
    pub sa: cl_float,
    pub sb: cl_float,
    pub sc: cl_float,
    pub sd: cl_float,
    pub se: cl_float,
    pub sf: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_float16__bindgen_ty_1>() - 64usize];
    ["Alignment of cl_float16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_float16__bindgen_ty_1>() - 4usize];
    ["Offset of field: cl_float16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_float16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, y) - 4usize];
    ["Offset of field: cl_float16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, z) - 8usize];
    ["Offset of field: cl_float16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, w) - 12usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer4) - 16usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer5) - 20usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer6) - 24usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer7) - 28usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer8) - 32usize];
    ["Offset of field: cl_float16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, __spacer9) - 36usize];
    ["Offset of field: cl_float16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, sa) - 40usize];
    ["Offset of field: cl_float16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, sb) - 44usize];
    ["Offset of field: cl_float16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, sc) - 48usize];
    ["Offset of field: cl_float16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, sd) - 52usize];
    ["Offset of field: cl_float16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, se) - 56usize];
    ["Offset of field: cl_float16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_1, sf) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_float16__bindgen_ty_2 {
    pub s0: cl_float,
    pub s1: cl_float,
    pub s2: cl_float,
    pub s3: cl_float,
    pub s4: cl_float,
    pub s5: cl_float,
    pub s6: cl_float,
    pub s7: cl_float,
    pub s8: cl_float,
    pub s9: cl_float,
    pub sA: cl_float,
    pub sB: cl_float,
    pub sC: cl_float,
    pub sD: cl_float,
    pub sE: cl_float,
    pub sF: cl_float,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_float16__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_float16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_float16__bindgen_ty_2>() - 4usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s1) - 4usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s2) - 8usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s3) - 12usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s4) - 16usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s5) - 20usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s6) - 24usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s7) - 28usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s8) - 32usize];
    ["Offset of field: cl_float16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, s9) - 36usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sA) - 40usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sB) - 44usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sC) - 48usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sD) - 52usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sE) - 56usize];
    ["Offset of field: cl_float16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_2, sF) - 60usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_float16__bindgen_ty_3 {
    pub lo: cl_float8,
    pub hi: cl_float8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_float16__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_float16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_float16__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_float16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_float16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_float16__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_float16"][::std::mem::size_of::<cl_float16>() - 64usize];
    ["Alignment of cl_float16"][::std::mem::align_of::<cl_float16>() - 64usize];
    ["Offset of field: cl_float16::s"][::std::mem::offset_of!(cl_float16, s) - 0usize];
    ["Offset of field: cl_float16::v2"][::std::mem::offset_of!(cl_float16, v2) - 0usize];
    ["Offset of field: cl_float16::v4"][::std::mem::offset_of!(cl_float16, v4) - 0usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union cl_double2 {
    pub s: [cl_double; 2usize],
    pub __bindgen_anon_1: cl_double2__bindgen_ty_1,
    pub __bindgen_anon_2: cl_double2__bindgen_ty_2,
    pub __bindgen_anon_3: cl_double2__bindgen_ty_3,
    pub v2: __cl_double2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_1 {
    pub x: cl_double,
    pub y: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_1"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_1>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_1"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_1, y) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_2 {
    pub s0: cl_double,
    pub s1: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_2"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_2>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_2"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_2, s1) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double2__bindgen_ty_3 {
    pub lo: cl_double,
    pub hi: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2__bindgen_ty_3"]
        [::std::mem::size_of::<cl_double2__bindgen_ty_3>() - 16usize];
    ["Alignment of cl_double2__bindgen_ty_3"]
        [::std::mem::align_of::<cl_double2__bindgen_ty_3>() - 8usize];
    ["Offset of field: cl_double2__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_double2__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_double2__bindgen_ty_3, hi) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double2"][::std::mem::size_of::<cl_double2>() - 16usize];
    ["Alignment of cl_double2"][::std::mem::align_of::<cl_double2>() - 16usize];
    ["Offset of field: cl_double2::s"][::std::mem::offset_of!(cl_double2, s) - 0usize];
    ["Offset of field: cl_double2::v2"][::std::mem::offset_of!(cl_double2, v2) - 0usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union cl_double4 {
    pub s: [cl_double; 4usize],
    pub __bindgen_anon_1: cl_double4__bindgen_ty_1,
    pub __bindgen_anon_2: cl_double4__bindgen_ty_2,
    pub __bindgen_anon_3: cl_double4__bindgen_ty_3,
    pub v2: [__cl_double2; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double4__bindgen_ty_1 {
    pub x: cl_double,
    pub y: cl_double,
    pub z: cl_double,
    pub w: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double4__bindgen_ty_1"]
        [::std::mem::size_of::<cl_double4__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_double4__bindgen_ty_1"]
        [::std::mem::align_of::<cl_double4__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_double4__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_double4__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_double4__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_double4__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double4__bindgen_ty_2 {
    pub s0: cl_double,
    pub s1: cl_double,
    pub s2: cl_double,
    pub s3: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double4__bindgen_ty_2"]
        [::std::mem::size_of::<cl_double4__bindgen_ty_2>() - 32usize];
    ["Alignment of cl_double4__bindgen_ty_2"]
        [::std::mem::align_of::<cl_double4__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_double4__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_double4__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_double4__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_double4__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_2, s3) - 24usize];
};
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct cl_double4__bindgen_ty_3 {
    pub lo: cl_double2,
    pub hi: cl_double2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double4__bindgen_ty_3"]
        [::std::mem::size_of::<cl_double4__bindgen_ty_3>() - 32usize];
    ["Alignment of cl_double4__bindgen_ty_3"]
        [::std::mem::align_of::<cl_double4__bindgen_ty_3>() - 16usize];
    ["Offset of field: cl_double4__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_double4__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_double4__bindgen_ty_3, hi) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double4"][::std::mem::size_of::<cl_double4>() - 32usize];
    ["Alignment of cl_double4"][::std::mem::align_of::<cl_double4>() - 32usize];
    ["Offset of field: cl_double4::s"][::std::mem::offset_of!(cl_double4, s) - 0usize];
    ["Offset of field: cl_double4::v2"][::std::mem::offset_of!(cl_double4, v2) - 0usize];
};
pub type cl_double3 = cl_double4;
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union cl_double8 {
    pub s: [cl_double; 8usize],
    pub __bindgen_anon_1: cl_double8__bindgen_ty_1,
    pub __bindgen_anon_2: cl_double8__bindgen_ty_2,
    pub __bindgen_anon_3: cl_double8__bindgen_ty_3,
    pub v2: [__cl_double2; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double8__bindgen_ty_1 {
    pub x: cl_double,
    pub y: cl_double,
    pub z: cl_double,
    pub w: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double8__bindgen_ty_1"]
        [::std::mem::size_of::<cl_double8__bindgen_ty_1>() - 32usize];
    ["Alignment of cl_double8__bindgen_ty_1"]
        [::std::mem::align_of::<cl_double8__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_double8__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_double8__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_double8__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_double8__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_1, w) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double8__bindgen_ty_2 {
    pub s0: cl_double,
    pub s1: cl_double,
    pub s2: cl_double,
    pub s3: cl_double,
    pub s4: cl_double,
    pub s5: cl_double,
    pub s6: cl_double,
    pub s7: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double8__bindgen_ty_2"]
        [::std::mem::size_of::<cl_double8__bindgen_ty_2>() - 64usize];
    ["Alignment of cl_double8__bindgen_ty_2"]
        [::std::mem::align_of::<cl_double8__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_double8__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_2, s7) - 56usize];
};
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub struct cl_double8__bindgen_ty_3 {
    pub lo: cl_double4,
    pub hi: cl_double4,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double8__bindgen_ty_3"]
        [::std::mem::size_of::<cl_double8__bindgen_ty_3>() - 64usize];
    ["Alignment of cl_double8__bindgen_ty_3"]
        [::std::mem::align_of::<cl_double8__bindgen_ty_3>() - 32usize];
    ["Offset of field: cl_double8__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_double8__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_double8__bindgen_ty_3, hi) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double8"][::std::mem::size_of::<cl_double8>() - 64usize];
    ["Alignment of cl_double8"][::std::mem::align_of::<cl_double8>() - 64usize];
    ["Offset of field: cl_double8::s"][::std::mem::offset_of!(cl_double8, s) - 0usize];
    ["Offset of field: cl_double8::v2"][::std::mem::offset_of!(cl_double8, v2) - 0usize];
};
#[repr(C)]
#[repr(align(128))]
#[derive(Copy, Clone)]
pub union cl_double16 {
    pub s: [cl_double; 16usize],
    pub __bindgen_anon_1: cl_double16__bindgen_ty_1,
    pub __bindgen_anon_2: cl_double16__bindgen_ty_2,
    pub __bindgen_anon_3: cl_double16__bindgen_ty_3,
    pub v2: [__cl_double2; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double16__bindgen_ty_1 {
    pub x: cl_double,
    pub y: cl_double,
    pub z: cl_double,
    pub w: cl_double,
    pub __spacer4: cl_double,
    pub __spacer5: cl_double,
    pub __spacer6: cl_double,
    pub __spacer7: cl_double,
    pub __spacer8: cl_double,
    pub __spacer9: cl_double,
    pub sa: cl_double,
    pub sb: cl_double,
    pub sc: cl_double,
    pub sd: cl_double,
    pub se: cl_double,
    pub sf: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double16__bindgen_ty_1"]
        [::std::mem::size_of::<cl_double16__bindgen_ty_1>() - 128usize];
    ["Alignment of cl_double16__bindgen_ty_1"]
        [::std::mem::align_of::<cl_double16__bindgen_ty_1>() - 8usize];
    ["Offset of field: cl_double16__bindgen_ty_1::x"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, x) - 0usize];
    ["Offset of field: cl_double16__bindgen_ty_1::y"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, y) - 8usize];
    ["Offset of field: cl_double16__bindgen_ty_1::z"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, z) - 16usize];
    ["Offset of field: cl_double16__bindgen_ty_1::w"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, w) - 24usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer4"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer4) - 32usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer5"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer5) - 40usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer6"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer6) - 48usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer7"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer7) - 56usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer8"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer8) - 64usize];
    ["Offset of field: cl_double16__bindgen_ty_1::__spacer9"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, __spacer9) - 72usize];
    ["Offset of field: cl_double16__bindgen_ty_1::sa"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, sa) - 80usize];
    ["Offset of field: cl_double16__bindgen_ty_1::sb"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, sb) - 88usize];
    ["Offset of field: cl_double16__bindgen_ty_1::sc"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, sc) - 96usize];
    ["Offset of field: cl_double16__bindgen_ty_1::sd"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, sd) - 104usize];
    ["Offset of field: cl_double16__bindgen_ty_1::se"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, se) - 112usize];
    ["Offset of field: cl_double16__bindgen_ty_1::sf"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_1, sf) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cl_double16__bindgen_ty_2 {
    pub s0: cl_double,
    pub s1: cl_double,
    pub s2: cl_double,
    pub s3: cl_double,
    pub s4: cl_double,
    pub s5: cl_double,
    pub s6: cl_double,
    pub s7: cl_double,
    pub s8: cl_double,
    pub s9: cl_double,
    pub sA: cl_double,
    pub sB: cl_double,
    pub sC: cl_double,
    pub sD: cl_double,
    pub sE: cl_double,
    pub sF: cl_double,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double16__bindgen_ty_2"]
        [::std::mem::size_of::<cl_double16__bindgen_ty_2>() - 128usize];
    ["Alignment of cl_double16__bindgen_ty_2"]
        [::std::mem::align_of::<cl_double16__bindgen_ty_2>() - 8usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s0"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s0) - 0usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s1"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s1) - 8usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s2"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s2) - 16usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s3"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s3) - 24usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s4"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s4) - 32usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s5"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s5) - 40usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s6"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s6) - 48usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s7"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s7) - 56usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s8"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s8) - 64usize];
    ["Offset of field: cl_double16__bindgen_ty_2::s9"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, s9) - 72usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sA"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sA) - 80usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sB"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sB) - 88usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sC"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sC) - 96usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sD"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sD) - 104usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sE"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sE) - 112usize];
    ["Offset of field: cl_double16__bindgen_ty_2::sF"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_2, sF) - 120usize];
};
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub struct cl_double16__bindgen_ty_3 {
    pub lo: cl_double8,
    pub hi: cl_double8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double16__bindgen_ty_3"]
        [::std::mem::size_of::<cl_double16__bindgen_ty_3>() - 128usize];
    ["Alignment of cl_double16__bindgen_ty_3"]
        [::std::mem::align_of::<cl_double16__bindgen_ty_3>() - 64usize];
    ["Offset of field: cl_double16__bindgen_ty_3::lo"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_3, lo) - 0usize];
    ["Offset of field: cl_double16__bindgen_ty_3::hi"]
        [::std::mem::offset_of!(cl_double16__bindgen_ty_3, hi) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cl_double16"][::std::mem::size_of::<cl_double16>() - 128usize];
    ["Alignment of cl_double16"][::std::mem::align_of::<cl_double16>() - 128usize];
    ["Offset of field: cl_double16::s"][::std::mem::offset_of!(cl_double16, s) - 0usize];
    ["Offset of field: cl_double16::v2"][::std::mem::offset_of!(cl_double16, v2) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_platform_id {
    _unused: [u8; 0],
}
pub type cl_platform_id = *mut _cl_platform_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_device_id {
    _unused: [u8; 0],
}
pub type cl_device_id = *mut _cl_device_id;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_context {
    _unused: [u8; 0],
}
pub type cl_context = *mut _cl_context;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_command_queue {
    _unused: [u8; 0],
}
pub type cl_command_queue = *mut _cl_command_queue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_mem {
    _unused: [u8; 0],
}
pub type cl_mem = *mut _cl_mem;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_program {
    _unused: [u8; 0],
}
pub type cl_program = *mut _cl_program;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_kernel {
    _unused: [u8; 0],
}
pub type cl_kernel = *mut _cl_kernel;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_event {
    _unused: [u8; 0],
}
pub type cl_event = *mut _cl_event;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_sampler {
    _unused: [u8; 0],
}
pub type cl_sampler = *mut _cl_sampler;
pub type cl_bool = cl_uint;
pub type cl_bitfield = cl_ulong;
pub type cl_properties = cl_ulong;
pub type cl_device_type = cl_bitfield;
pub type cl_platform_info = cl_uint;
pub type cl_device_info = cl_uint;
pub type cl_device_fp_config = cl_bitfield;
pub type cl_device_mem_cache_type = cl_uint;
pub type cl_device_local_mem_type = cl_uint;
pub type cl_device_exec_capabilities = cl_bitfield;
pub type cl_device_svm_capabilities = cl_bitfield;
pub type cl_command_queue_properties = cl_bitfield;
pub type cl_device_partition_property = isize;
pub type cl_device_affinity_domain = cl_bitfield;
pub type cl_context_properties = isize;
pub type cl_context_info = cl_uint;
pub type cl_queue_properties = cl_properties;
pub type cl_command_queue_info = cl_uint;
pub type cl_channel_order = cl_uint;
pub type cl_channel_type = cl_uint;
pub type cl_mem_flags = cl_bitfield;
pub type cl_svm_mem_flags = cl_bitfield;
pub type cl_mem_object_type = cl_uint;
pub type cl_mem_info = cl_uint;
pub type cl_mem_migration_flags = cl_bitfield;
pub type cl_image_info = cl_uint;
pub type cl_buffer_create_type = cl_uint;
pub type cl_addressing_mode = cl_uint;
pub type cl_filter_mode = cl_uint;
pub type cl_sampler_info = cl_uint;
pub type cl_map_flags = cl_bitfield;
pub type cl_pipe_properties = isize;
pub type cl_pipe_info = cl_uint;
pub type cl_program_info = cl_uint;
pub type cl_program_build_info = cl_uint;
pub type cl_program_binary_type = cl_uint;
pub type cl_build_status = cl_int;
pub type cl_kernel_info = cl_uint;
pub type cl_kernel_arg_info = cl_uint;
pub type cl_kernel_arg_address_qualifier = cl_uint;
pub type cl_kernel_arg_access_qualifier = cl_uint;
pub type cl_kernel_arg_type_qualifier = cl_bitfield;
pub type cl_kernel_work_group_info = cl_uint;
pub type cl_kernel_sub_group_info = cl_uint;
pub type cl_event_info = cl_uint;
pub type cl_command_type = cl_uint;
pub type cl_profiling_info = cl_uint;
pub type cl_sampler_properties = cl_properties;
pub type cl_kernel_exec_info = cl_uint;
pub type cl_device_atomic_capabilities = cl_bitfield;
pub type cl_device_device_enqueue_capabilities = cl_bitfield;
pub type cl_khronos_vendor_id = cl_uint;
pub type cl_mem_properties = cl_properties;
pub type cl_version = cl_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_image_format {
    pub image_channel_order: cl_channel_order,
    pub image_channel_data_type: cl_channel_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cl_image_format"][::std::mem::size_of::<_cl_image_format>() - 8usize];
    ["Alignment of _cl_image_format"][::std::mem::align_of::<_cl_image_format>() - 4usize];
    ["Offset of field: _cl_image_format::image_channel_order"]
        [::std::mem::offset_of!(_cl_image_format, image_channel_order) - 0usize];
    ["Offset of field: _cl_image_format::image_channel_data_type"]
        [::std::mem::offset_of!(_cl_image_format, image_channel_data_type) - 4usize];
};
pub type cl_image_format = _cl_image_format;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _cl_image_desc {
    pub image_type: cl_mem_object_type,
    pub image_width: usize,
    pub image_height: usize,
    pub image_depth: usize,
    pub image_array_size: usize,
    pub image_row_pitch: usize,
    pub image_slice_pitch: usize,
    pub num_mip_levels: cl_uint,
    pub num_samples: cl_uint,
    pub __bindgen_anon_1: _cl_image_desc__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _cl_image_desc__bindgen_ty_1 {
    pub buffer: cl_mem,
    pub mem_object: cl_mem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cl_image_desc__bindgen_ty_1"]
        [::std::mem::size_of::<_cl_image_desc__bindgen_ty_1>() - 8usize];
    ["Alignment of _cl_image_desc__bindgen_ty_1"]
        [::std::mem::align_of::<_cl_image_desc__bindgen_ty_1>() - 8usize];
    ["Offset of field: _cl_image_desc__bindgen_ty_1::buffer"]
        [::std::mem::offset_of!(_cl_image_desc__bindgen_ty_1, buffer) - 0usize];
    ["Offset of field: _cl_image_desc__bindgen_ty_1::mem_object"]
        [::std::mem::offset_of!(_cl_image_desc__bindgen_ty_1, mem_object) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cl_image_desc"][::std::mem::size_of::<_cl_image_desc>() - 72usize];
    ["Alignment of _cl_image_desc"][::std::mem::align_of::<_cl_image_desc>() - 8usize];
    ["Offset of field: _cl_image_desc::image_type"]
        [::std::mem::offset_of!(_cl_image_desc, image_type) - 0usize];
    ["Offset of field: _cl_image_desc::image_width"]
        [::std::mem::offset_of!(_cl_image_desc, image_width) - 8usize];
    ["Offset of field: _cl_image_desc::image_height"]
        [::std::mem::offset_of!(_cl_image_desc, image_height) - 16usize];
    ["Offset of field: _cl_image_desc::image_depth"]
        [::std::mem::offset_of!(_cl_image_desc, image_depth) - 24usize];
    ["Offset of field: _cl_image_desc::image_array_size"]
        [::std::mem::offset_of!(_cl_image_desc, image_array_size) - 32usize];
    ["Offset of field: _cl_image_desc::image_row_pitch"]
        [::std::mem::offset_of!(_cl_image_desc, image_row_pitch) - 40usize];
    ["Offset of field: _cl_image_desc::image_slice_pitch"]
        [::std::mem::offset_of!(_cl_image_desc, image_slice_pitch) - 48usize];
    ["Offset of field: _cl_image_desc::num_mip_levels"]
        [::std::mem::offset_of!(_cl_image_desc, num_mip_levels) - 56usize];
    ["Offset of field: _cl_image_desc::num_samples"]
        [::std::mem::offset_of!(_cl_image_desc, num_samples) - 60usize];
};
pub type cl_image_desc = _cl_image_desc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_buffer_region {
    pub origin: usize,
    pub size: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cl_buffer_region"][::std::mem::size_of::<_cl_buffer_region>() - 16usize];
    ["Alignment of _cl_buffer_region"][::std::mem::align_of::<_cl_buffer_region>() - 8usize];
    ["Offset of field: _cl_buffer_region::origin"]
        [::std::mem::offset_of!(_cl_buffer_region, origin) - 0usize];
    ["Offset of field: _cl_buffer_region::size"]
        [::std::mem::offset_of!(_cl_buffer_region, size) - 8usize];
};
pub type cl_buffer_region = _cl_buffer_region;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cl_name_version {
    pub version: cl_version,
    pub name: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _cl_name_version"][::std::mem::size_of::<_cl_name_version>() - 68usize];
    ["Alignment of _cl_name_version"][::std::mem::align_of::<_cl_name_version>() - 4usize];
    ["Offset of field: _cl_name_version::version"]
        [::std::mem::offset_of!(_cl_name_version, version) - 0usize];
    ["Offset of field: _cl_name_version::name"]
        [::std::mem::offset_of!(_cl_name_version, name) - 4usize];
};
pub type cl_name_version = _cl_name_version;
// #[link(name = "OpenCL")]
extern "C" {
    pub fn clGetPlatformIDs(
        num_entries: cl_uint,
        platforms: *mut cl_platform_id,
        num_platforms: *mut cl_uint,
    ) -> cl_int;
}
extern "C" {
    pub fn clGetPlatformInfo(
        platform: cl_platform_id,
        param_name: cl_platform_info,
        param_value_size: usize,
        param_value: *mut ::std::os::raw::c_void,
        param_value_size_ret: *mut usize,
    ) -> cl_int;
}
extern "C" {
    pub fn clGetDeviceIDs(
        platform: cl_platform_id,
        device_type: cl_device_type,
        num_entries: cl_uint,
        devices: *mut cl_device_id,
        num_devices: *mut cl_uint,
    ) -> cl_int;
}
extern "C" {
    pub fn clGetDeviceInfo(
        device: cl_device_id,
        param_name: cl_device_info,
        param_value_size: usize,
